arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_aux_wuc.h
// Field:     [4] ANAIF
//
// Enables (1) or disables (0) clock for AUX_ANAIF.
//
// Note that the ADC internal clock must be requested separately using
// ADCCLKCTL.
// ENUMs:
// EN                       System CPU has requested clock for SOC
// DIS                      System CPU has not requested clock for SOC
#define AUX_WUC_MODCLKEN0_ANAIF                                     0x00000010
#define AUX_WUC_MODCLKEN0_ANAIF_BITN                                         4
#define AUX_WUC_MODCLKEN0_ANAIF_M                                   0x00000010
#define AUX_WUC_MODCLKEN0_ANAIF_S                                            4
#define AUX_WUC_MODCLKEN0_ANAIF_EN                                  0x00000010
#define AUX_WUC_MODCLKEN0_ANAIF_DIS                                 0x00000000

// Field:     [3] TIMER
//
// Enables (1) or disables (0) clock for AUX_TIMER.
// ENUMs:
// EN                       System CPU has requested clock for TIMER
// DIS                      System CPU has not requested clock for TIMER
#define AUX_WUC_MODCLKEN0_TIMER                                     0x00000008
#define AUX_WUC_MODCLKEN0_TIMER_BITN                                         3
#define AUX_WUC_MODCLKEN0_TIMER_M                                   0x00000008
#define AUX_WUC_MODCLKEN0_TIMER_S                                            3
#define AUX_WUC_MODCLKEN0_TIMER_EN                                  0x00000008
#define AUX_WUC_MODCLKEN0_TIMER_DIS                                 0x00000000

// Field:     [2] AIODIO1
//
// Enables (1) or disables (0) clock for AUX_AIODIO1.
// ENUMs:
// EN                       System CPU has requested clock for AIODIO1
// DIS                      System CPU has not requested clock for AIODIO1
#define AUX_WUC_MODCLKEN0_AIODIO1                                   0x00000004
#define AUX_WUC_MODCLKEN0_AIODIO1_BITN                                       2
#define AUX_WUC_MODCLKEN0_AIODIO1_M                                 0x00000004
#define AUX_WUC_MODCLKEN0_AIODIO1_S                                          2
#define AUX_WUC_MODCLKEN0_AIODIO1_EN                                0x00000004
#define AUX_WUC_MODCLKEN0_AIODIO1_DIS                               0x00000000

// Field:     [1] AIODIO0
//
// Enables (1) or disables (0) clock for AUX_AIODIO0.
// ENUMs:
// EN                       System CPU has requested clock for AIODIO0
// DIS                      System CPU has not requested clock for AIODIO0
#define AUX_WUC_MODCLKEN0_AIODIO0                                   0x00000002
#define AUX_WUC_MODCLKEN0_AIODIO0_BITN                                       1
#define AUX_WUC_MODCLKEN0_AIODIO0_M                                 0x00000002
#define AUX_WUC_MODCLKEN0_AIODIO0_S                                          1
#define AUX_WUC_MODCLKEN0_AIODIO0_EN                                0x00000002
#define AUX_WUC_MODCLKEN0_AIODIO0_DIS                               0x00000000

// Field:     [0] SMPH
//
// Enables (1) or disables (0) clock for AUX_SMPH.
// ENUMs:
// EN                       System CPU has requested clock for SMPH
// DIS                      System CPU has not requested clock for SMPH
#define AUX_WUC_MODCLKEN0_SMPH                                      0x00000001
#define AUX_WUC_MODCLKEN0_SMPH_BITN                                          0
#define AUX_WUC_MODCLKEN0_SMPH_M                                    0x00000001
#define AUX_WUC_MODCLKEN0_SMPH_S                                             0
#define AUX_WUC_MODCLKEN0_SMPH_EN                                   0x00000001
#define AUX_WUC_MODCLKEN0_SMPH_DIS                                  0x00000000

//*****************************************************************************
//
// Register: AUX_WUC_O_PWROFFREQ
//
//*****************************************************************************
// Field:     [0] REQ
//
// Power off request
//
// 0: No action
// 1: Request to power down AUX. Once set, this bit shall not be cleared. The
// bit will be reset again when AUX is powered up again.
//
// The request will only happen if AONCTLSTAT.AUX_FORCE_ON = 0 and
// MCUBUSSTAT.DISCONNECTED=1.
#define AUX_WUC_PWROFFREQ_REQ                                       0x00000001
#define AUX_WUC_PWROFFREQ_REQ_BITN                                           0
#define AUX_WUC_PWROFFREQ_REQ_M                                     0x00000001
#define AUX_WUC_PWROFFREQ_REQ_S                                              0

//*****************************************************************************
//
// Register: AUX_WUC_O_PWRDWNREQ
//
//*****************************************************************************
// Field:     [0] REQ
//
// Power down request
//
// 0: Request for system to be in active mode
// 1: Request for system to be in power down mode
//
// When REQ is 1 one shall assume that the system is in power down, and that
// current supply is limited. When setting REQ = 0, one shall assume that the
// system is in power down until  PWRDWNACK.ACK = 0
#define AUX_WUC_PWRDWNREQ_REQ                                       0x00000001
#define AUX_WUC_PWRDWNREQ_REQ_BITN                                           0
#define AUX_WUC_PWRDWNREQ_REQ_M                                     0x00000001
#define AUX_WUC_PWRDWNREQ_REQ_S                                              0

//*****************************************************************************
//
// Register: AUX_WUC_O_PWRDWNACK
//
//*****************************************************************************
// Field:     [0] ACK
//
// Power down acknowledgment. Indicates whether the power down request given by
// PWRDWNREQ.REQ is captured by the AON domain or not
//
// 0: AUX can assume that the system is in active mode
// 1: The request for power down is acknowledged and the AUX must act like the
// system is in power down mode and power supply is limited
//
// The system CPU cannot use this bit since the bus bridge between MCU domain
// and AUX domain is always disconnected when this bit is set. For AUX_SCE use
// only
#define AUX_WUC_PWRDWNACK_ACK                                       0x00000001
#define AUX_WUC_PWRDWNACK_ACK_BITN                                           0
#define AUX_WUC_PWRDWNACK_ACK_M                                     0x00000001
#define AUX_WUC_PWRDWNACK_ACK_S                                              0

//*****************************************************************************
//
// Register: AUX_WUC_O_CLKLFREQ
//
//*****************************************************************************
// Field:     [0] REQ
//
// Low frequency request
//
// 0: Request clock frequency to be controlled by AON_WUC:AUXCLK and the system
// state
// 1: Request low frequency clock SCLK_LF as the clock source for AUX
//
// This bit must not be modified unless CLKLFACK.ACK matches the current value
#define AUX_WUC_CLKLFREQ_REQ                                        0x00000001
#define AUX_WUC_CLKLFREQ_REQ_BITN                                            0
#define AUX_WUC_CLKLFREQ_REQ_M                                      0x00000001
#define AUX_WUC_CLKLFREQ_REQ_S                                               0

//*****************************************************************************
//
// Register: AUX_WUC_O_CLKLFACK
//
//*****************************************************************************
// Field:     [0] ACK
//
// Acknowledgment of CLKLFREQ.REQ
//
// 0: Acknowledgement that clock frequency is controlled by AON_WUC:AUXCLK and
// the system state
// 1: Acknowledgement that the low frequency clock SCLK_LF is the clock source
// for AUX
#define AUX_WUC_CLKLFACK_ACK                                        0x00000001
#define AUX_WUC_CLKLFACK_ACK_BITN                                            0
#define AUX_WUC_CLKLFACK_ACK_M                                      0x00000001
#define AUX_WUC_CLKLFACK_ACK_S                                               0

//*****************************************************************************
//
// Register: AUX_WUC_O_WUEVFLAGS
//
//*****************************************************************************
// Field:     [2] AON_RTC_CH2
//
// Indicates pending event from AON_RTC_CH2 compare. Note that this flag will
// be set whenever the AON_RTC_CH2 event happens, but that does not mean that
// this event is a wake-up event. To make the AON_RTC_CH2 a wake-up event for
// the AUX domain configure it as a wake-up event in AON_EVENT:AUXWUSEL.WU0_EV,
// AON_EVENT:AUXWUSEL.WU1_EV or AON_EVENT:AUXWUSEL.WU2_EV.
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2                               0x00000004
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2_BITN                                   2
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2_M                             0x00000004
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2_S                                      2

// Field:     [1] AON_SW
//
// Indicates pending event triggered by system CPU writing a 1 to
// AON_WUC:AUXCTL.SWEV.
#define AUX_WUC_WUEVFLAGS_AON_SW                                    0x00000002
#define AUX_WUC_WUEVFLAGS_AON_SW_BITN                                        1
#define AUX_WUC_WUEVFLAGS_AON_SW_M                                  0x00000002
#define AUX_WUC_WUEVFLAGS_AON_SW_S                                           1

